codeigniter4-framework-b3359be/app/Controllers/Admin.php

INSERT INTO `foods` (`name`, `description`, `price`, `category`, `image`) VALUES ('Çift Cheeseburger', 'burger-cheese-salatalik-domates', '450', 'burgers', '1778523213_5274478ffd93faf88d4b.png')
---
 public function storeFood()
{
    $foodModel = new \App\Models\FoodModel();

    $image = $this->request->getFile('image');

    $newName = '';

    if ($image && $image->isValid()) {

        $newName = $image->getRandomName();

        $image->move(FCPATH . 'uploads/foods', $newName);
    }

    $foodModel->insert([

        'name' => $this->request->getPost('name'),

        'description' => $this->request->getPost('description'),

        'price' => $this->request->getPost('price'),

        'category' => $this->request->getPost('category'),

        'image' => $newName
    ]);