codeigniter4-framework-b3359be/app/Controllers/Auth.php

    public function store()
    {
        $userModel = new UserModel();

        $userModel->insert([

            'name' => $this->request->getPost('name'),

            'email' => $this->request->getPost('email'),

            'password' => password_hash(
                $this->request->getPost('password'),
                PASSWORD_DEFAULT
            ),

            'role' => 'user'
        ]);
---
INSERT INTO `users` (`name`, `email`, `password`, `role`) VALUES ('HAMZA ADEL', 'haamzz2022@gmail.com', '$2y$10$yFakc0dxxh9TEJyEWlMl/OGnsCRBinE6ionosUtGC4xMJ3I.x21OK', 'user')

    public function authenticate()
    {
        $userModel = new UserModel();

        $user = $userModel
            ->where('email', $this->request->getPost('email'))
            ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'haamzz2022@gmail.com'
 LIMIT 1