app/Controllers/Cart.php

SELECT *
FROM `foods`
WHERE `foods`.`id` = '4'
---
    public function add($id)
{
    $foodModel = new FoodModel();

    $food = $foodModel->find($id);

INSERT INTO `orders` (`user_id`, `total`, `status`) VALUES (NULL, 540, 'pending')
INSERT INTO `order_items` (`order_id`, `food_id`, `quantity`) VALUES (7, '4', 2)
---
    public function checkout()
    {
        $cart = session()->get('cart');

        if (!$cart) {
            return redirect()->to('/cart');
        }

        $db = \Config\Database::connect();

        $total = 0;

        foreach ($cart as $item) {
            $total += $item['price'] * $item['qty'];
        }

        $discount = session()->get('discount') ?? 0;

$discountAmount = ($total * $discount) / 100;

$total = $total - $discountAmount;
        $db->table('orders')->insert([
            'user_id' => session()->get('user_id'),
            'total' => $total,
            'status' => 'pending'
        ]);

        $orderId = $db->insertID();

        foreach ($cart as $item) {
            $db->table('order_items')->insert([
                'order_id' => $orderId,
                'food_id' => $item['id'],
                'quantity' => $item['qty']
            ]);

SELECT *
FROM `orders`
WHERE `id` = '7'
---
    public function invoice($id)
    {
        $db = \Config\Database::connect();

        $order = $db->table('orders')
            ->where('id', $id)
            ->get()
            ->getRowArray();