app/Controllers/Menu.php

SELECT *
FROM `foods`
WHERE `category` = 'pizzas'
SELECT *
FROM `foods`
---
    public function index()
    {
        $category = $this->request->getGet('category');

        $foodModel = new FoodModel();

        if ($category) {
            $foods = $foodModel->where('category', $category)->findAll();
        } else {
            $foods = $foodModel->findAll();